app/views/carts/_cart_item.html.erb

		<div>
		    <h5>Order Total: <%= "(#{current_order.order_items.size} item(s))"%></h5>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]