app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]
INSERT INTO "order_items" ("product_id", "order_id", "unit_price", "quantity", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["product_id", 3], ["order_id", 1], ["unit_price", 99.0], ["quantity", 1], ["total_price", 99.0], ["created_at", "2018-04-01 12:15:11.240074"], ["updated_at", "2018-04-01 12:15:11.240074"]]
INSERT INTO "orders" ("created_at", "updated_at", "subtotal") VALUES (?, ?, ?)  [["created_at", "2018-04-01 12:15:11.237197"], ["updated_at", "2018-04-01 12:15:11.237197"], ["subtotal", 99.0]]
---
	def create
		@order = current_order
		@order_item = @order.order_items.new(order_item_params)
		@order.save!

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "order_items" SET "quantity" = ?, "total_price" = ?, "updated_at" = ? WHERE "order_items"."id" = ?  [["quantity", 2], ["total_price", 198.0], ["updated_at", "2018-04-01 12:19:48.201927"], ["id", 1]]
---
	def update
		@order = current_order
		@order_item = @order.order_items.find(params[:id])
		@order_item.update_attributes(order_item_params)

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 1]]
---
	def destroy
		@order = current_order
		@order_item = @order.order_items.find(params[:id])
		@order.save!
		@order_item.destroy