app/controllers/products_controller.rb

  def index
    @products = Product.all
    @order_item = current_order.order_items.new
---
SELECT "products".* FROM "products"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]

  def show
    @order_item = current_order.order_items.new
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("product", "description", "image_url", "price", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "product" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["product", "Wigwam's Warm Winter Socks - MEN'S"], ["updated_at", "2018-03-28 22:13:36.226245"], ["id", 5]]