app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("firstname", "lastname", "address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "Cathy"], ["lastname", "Lane"], ["address", "Swords"], ["user_id", 1], ["created_at", "2018-03-23 17:20:11.937863"], ["updated_at", "2018-03-23 17:20:11.937863"]]
---
  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def signedinuserprofile
    profile = Profile.find_by_user_id(current_user.id)