app/views/layouts/_cart.html.erb

<%= link_to "#{current_order.order_items.size} item(s) / price #{current_order.subtotal}", carts_path %>
---
SELECT  "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ? AND "order_items"."id" = ? LIMIT ?  [["order_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]